meeting/agenda/2025/10-14.org
:PROPERTIES:
:ID:       391CC78D-6248-4878-9A5F-09448E3E7D77
:END:
#+title: QT4 CG Meeting 138 Agenda 2025-10-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

Heads up: daylight saving time ends in the UK and Europe on 26 October 2025. It
ends in the United States on 2 November 2025. Our meetings are scheduled on
European civil time, consequently, our meeting of 29 October 2025 will occur one
hour *later* in the United States at 12:00EDT.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/10-07.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 14 October 2025.

The next meeting is planned for 21 October 2025.

** Review of open action items [5/5]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [X] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
  + Overtaken by [[https://github.com/qt4cg/qtspecs/issues/2245][#2245]].
+ [X] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [X] QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps
+ [X] QT4CG-137-01: NW to make a concrete proposal for tagged drafts
+ [X] QT4CG-137-02: NW to try to review the spec vis-a-vis #2148

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2224][#2224]]: 2148 fn:base-uri: Raise error
+ PR [[https://qt4cg.org/dashboard/#pr-2222][#2222]]: 2217 bin:decode-string: Input encoding
+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2244][#2244]]: Fix bibliographic reference
+ PR [[https://qt4cg.org/dashboard/#pr-2231][#2231]]: Updated status section for all documents

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1537][#1537]]: XSLT: local functions within an enclosing xsl:mode

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.
(This is not the proposed discussion order, see below.)

+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2246][#2246]]: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()
+ PR [[https://qt4cg.org/dashboard/#pr-2240][#2240]]: 2237 XSLT impact of multiple schemas
+ PR [[https://qt4cg.org/dashboard/#pr-2239][#2239]]: First cut at diagrams for JNodes (completes QT4CG-127-01)
+ PR [[https://qt4cg.org/dashboard/#pr-2236][#2236]]: 2235 Tweak the rules for default function namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2232][#2232]]: 1935 Errors from doc-available
+ PR [[https://qt4cg.org/dashboard/#pr-2228][#2228]]: 2012 Define array:sort-with, revise fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-2227][#2227]]: 2079 Allow optional prefix in EQName syntax
+ PR [[https://qt4cg.org/dashboard/#pr-2226][#2226]]: 2186 Change adaptive serialization of JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2225][#2225]]: 1718 Ordered Maps: positions in callback functions
+ PR [[https://qt4cg.org/dashboard/#pr-2223][#2223]]: 2193 fn:parse-xml, fn:doc: Drop security options
+ PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]: 2047 External resources and security
+ PR [[https://qt4cg.org/dashboard/#pr-2208][#2208]]: 675 (part) Update XSLT streamability rules
+ PR [[https://qt4cg.org/dashboard/#pr-2205][#2205]]: 2190 Drop binary input for parse-csv and parse-json
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

This agenda attempts to front-load PRs that appear to be straightforward and
likely to meet with quick approval. Proposals for reordering are always in
order, no pun intended.

+ PR [[https://qt4cg.org/dashboard/#pr-2239][#2239]]: First cut at diagrams for JNodes (completes QT4CG-127-01)
+ PR [[https://qt4cg.org/dashboard/#pr-2232][#2232]]: 1935 Errors from doc-available
+ PR [[https://qt4cg.org/dashboard/#pr-2228][#2228]]: 2012 Define array:sort-with, revise fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-2227][#2227]]: 2079 Allow optional prefix in EQName syntax
+ PR [[https://qt4cg.org/dashboard/#pr-2226][#2226]]: 2186 Change adaptive serialization of JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2225][#2225]]: 1718 Ordered Maps: positions in callback functions
+ PR [[https://qt4cg.org/dashboard/#pr-2240][#2240]]: 2237 XSLT impact of multiple schemas
+ PR [[https://qt4cg.org/dashboard/#pr-2236][#2236]]: 2235 Tweak the rules for default function namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2246][#2246]]: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()
+ PR [[https://qt4cg.org/dashboard/#pr-2223][#2223]]: 2193 fn:parse-xml, fn:doc: Drop security options
+ PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]: 2047 External resources and security
+ PR [[https://qt4cg.org/dashboard/#pr-2205][#2205]]: 2190 Drop binary input for parse-csv and parse-json
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
