meeting/agenda/2025/10-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 138 Agenda 2025-10-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 138 Agenda 2025-10-14</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>

<p>
Heads up: daylight saving time ends in the UK and Europe on 26 October 2025. It
ends in the United States on 2 November 2025. Our meetings are scheduled on
European civil time, consequently, our meeting of 29 October 2025 will occur one
hour <b>later</b> in the United States at 12:00EDT.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/10-07.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 14 October 2025.
</p>

<p>
The next meeting is planned for 21 October 2025.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[5/5]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
<ul class="org-ul">
<li>Overtaken by <a href="https://github.com/qt4cg/qtspecs/issues/2245">#2245</a>.</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="on"><code>[X]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="on"><code>[X]</code> QT4CG-137-01: NW to make a concrete proposal for tagged drafts</li>
<li class="on"><code>[X]</code> QT4CG-137-02: NW to try to review the spec vis-a-vis #2148</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2224">#2224</a>: 2148 fn:base-uri: Raise error</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2222">#2222</a>: 2217 bin:decode-string: Input encoding</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2244">#2244</a>: Fix bibliographic reference</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2231">#2231</a>: Updated status section for all documents</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1537">#1537</a>: XSLT: local functions within an enclosing xsl:mode</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
(This is not the proposed discussion order, see below.)
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2246">#2246</a>: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2240">#2240</a>: 2237 XSLT impact of multiple schemas</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2239">#2239</a>: First cut at diagrams for JNodes (completes QT4CG-127-01)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2236">#2236</a>: 2235 Tweak the rules for default function namespace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2232">#2232</a>: 1935 Errors from doc-available</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2228">#2228</a>: 2012 Define array:sort-with, revise fn:sort-with</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2227">#2227</a>: 2079 Allow optional prefix in EQName syntax</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2226">#2226</a>: 2186 Change adaptive serialization of JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2225">#2225</a>: 1718 Ordered Maps: positions in callback functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>: 2193 fn:parse-xml, fn:doc: Drop security options</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>: 2047 External resources and security</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2208">#2208</a>: 675 (part) Update XSLT streamability rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2205">#2205</a>: 2190 Drop binary input for parse-csv and parse-json</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
This agenda attempts to front-load PRs that appear to be straightforward and
likely to meet with quick approval. Proposals for reordering are always in
order, no pun intended.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2239">#2239</a>: First cut at diagrams for JNodes (completes QT4CG-127-01)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2232">#2232</a>: 1935 Errors from doc-available</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2228">#2228</a>: 2012 Define array:sort-with, revise fn:sort-with</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2227">#2227</a>: 2079 Allow optional prefix in EQName syntax</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2226">#2226</a>: 2186 Change adaptive serialization of JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2225">#2225</a>: 1718 Ordered Maps: positions in callback functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2240">#2240</a>: 2237 XSLT impact of multiple schemas</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2236">#2236</a>: 2235 Tweak the rules for default function namespace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2246">#2246</a>: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>: 2193 fn:parse-xml, fn:doc: Drop security options</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>: 2047 External resources and security</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2205">#2205</a>: 2190 Drop binary input for parse-csv and parse-json</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
</ul>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
